/* Copyright (c) 2020 Kneron, Inc. All Rights Reserved.
 *
 * The information contained herein is property of Kneron, Inc.
 * Terms and conditions of usage are described in detail in Kneron
 * STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information.
 * NO WARRANTY of ANY KIND is provided. This heading must NOT be removed
 * from the file.
 */

/******************************************************************************
*  Filename:
*  ---------
*  kdrv_i2c.c
*
*  Project:
*  --------
*  KL720
*
*  Description:
*  ------------
*  This is i2c driver
*
**
******************************************************************************/

/******************************************************************************
Head Block of The File
******************************************************************************/

#include <stdlib.h>
#include <cmsis_os2.h>
#include "kdrv_scu.h"
#include "kdrv_clock.h" // for kdrv_delay_us
#include "kdrv_i2c.h"
#include "regbase.h"
#include "base.h"
#include "system_config.h"
#include "kdrv_cmsis_core.h"

#define I2C_ENABLE_THREAD_SYNC // enable I2C thread synchronization
//#define I2C_DEBUG

/************************************************************************
*                     I2C Register Releated Macros                      *
************************************************************************/
typedef volatile union U_regIIC
{
    struct
    {
        uint32_t CR;            //0x00  I2C Control Register (CR)
        uint32_t SR;            //0x04  I2C Status Register (SR)
        uint32_t CDR;           //0x08  I2C Clock Division Register (CDR)
        uint32_t DR;            //0x0C  I2C Data Register (DR)
        uint32_t SAR;           //0x10  I2C Address Register (AR)
        uint32_t TGSR;          //0x14  I2C Setup/Hold Time and Glitch Suppression Setting Register (TGSR)
        uint32_t BMR;           //0x18  I2C Bus Monitor Register (BMR)
        uint32_t BSTMR;         //0x1C  I2C Burst Mode Register (BSTMR)
    }dw;    //double word

    struct
    {
        //I2C Control Register (CR, Offset: 0x00)
        uint32_t I2C_RST        :1;     //Reset the I2C controller
        uint32_t I2C_EN         :1;     //Enable the I2C bus interface controller
        uint32_t MST_EN         :1;     //Enable the I2C controller clock output for the master mode operation
        uint32_t GC_EN          :1;     //Enable the I2C controller to respond to a general call message as a slave
        uint32_t CR_START_      :1;     //I2C controller initiates a start condition when the I2C bus is idle or initiates a repeated start condition after transferring the next data byte on the I2C bus in the master mode.
        uint32_t CR_STOP_       :1;     //I2C controller initiates a stop condition after transferring the next data byte on the I2C bus when I2C is in the master mode.
        uint32_t ACK            :1;     //0: ACK  1: NACK
